Revit 2027 API
BRepBuilderState Enumeration
 This class defines an enumerative type used to specify the state of a BRepBuilder object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BRepBuilderState
Public Enumeration BRepBuilderState
public enum class BRepBuilderState
type BRepBuilderState
Members
Member name | Value | Description
AcceptingData | 1 |  BRepBuilder is accumulating data. New b-rep components such as edges or faces may be added.
Completed | 2 |  Finish() successfully created a valid Geometry object. No new data may be added.The built object may be retrieved via GetResult().
InvalidState | 0 |  BRepBuilder is in an invalid state. No further productive use is possible.
See Also
Reference
Autodesk.Revit.DB Namespace